Белгипрозем_2017/src/Documents/мИзменениеСведенийОСотрудниках/мИзменениеСведенийОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мИзменениеСведенийОСотрудниках</name>
  <registerRecords>InformationRegister.мСведенияОСотрудниках</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ранг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/мСведенияОСотрудниках/мСведенияОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мСведенияОСотрудниках</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.мВидыЗанятости</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ГруппыПользователей/ГруппыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПользователей</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВсеПользователи</name>
      <description>Все пользователи</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/мИзменениеСведенийОСотрудниках/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата - 24 * 60 * 60);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Подразделение", ДокументСсылка.Подразделение);
	Запрос.Текст ="ВЫБРАТЬ
	              |	Сотрудники.Период,
	              |	Сотрудники.Пользователь,
	              |	Сотрудники.Подразделение,
	              |	Сотрудники.Ссылка.Подразделение КАК ПодразделениеДо,
	              |	Сотрудники.Должность,
	              |	Сотрудники.ГрафикРаботы,
	              |	Сотрудники.Оклад,
	              |	Сотрудники.Ранг,
	              |	ГруппыПользователей1.Ссылка КАК ГруппаПользователейИз,
	              |	ГруппыПользователей.Ссылка КАК ГруппаПользователейВ
	              |ИЗ
	              |	Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК Сотрудники
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей КАК ГруппыПользователей
	              |		ПО (Сотрудники.Подразделение.Наименование ПОДОБНО ГруппыПользователей.Наименование)
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей КАК ГруппыПользователей1
	              |		ПО (Сотрудники.Ссылка.Подразделение.Наименование ПОДОБНО ГруппыПользователей1.Наименование)
	              |ГДЕ
	              |	Сотрудники.Ссылка = &Ссылка";
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Период,
				  //| мИзменениеСведенийОСотрудникахСотрудники.Пользователь,
				  //| мИзменениеСведенийОСотрудникахСотрудники.Оклад,
				  //| мИзменениеСведенийОСотрудникахСотрудники.Подразделение,
				  //| мИзменениеСведенийОСотрудникахСотрудники.Должность
				  //|ИЗ
				  //| Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
				  //|ГДЕ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Подразделение,
				  //| мИзменениеСведенийОСотрудникахСотрудники.Пользователь,
				  //| ГруппыПользователей.Ссылка
				  //|ПОМЕСТИТЬ Подразделения
				  //|ИЗ
				  //| Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
				  //|     ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей КАК ГруппыПользователей
				  //|     ПО (мИзменениеСведенийОСотрудникахСотрудники.Подразделение.Наименование ПОДОБНО ГруппыПользователей.Наименование)
				  //|ГДЕ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Пользователь
				  //|ПОМЕСТИТЬ Пользователи
				  //|ИЗ
				  //| Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
				  //|ГДЕ
				  //| мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //| мСведенияОСотрудникахСрезПоследних.Подразделение КАК ПодразделениеДо,
				  //| мСведенияОСотрудникахСрезПоследних.Должность,
				  //| Пользователи.Пользователь КАК Пользователь,
				  //| мСведенияОСотрудникахСрезПоследних.Пользователь КАК Пользователь1,
				  //| ГруппыПользователейСостав.Ссылка КАК ГруппаДо,
				  //| Подразделения.Подразделение КАК ПодразделениеПосле,
				  //| Подразделения.Ссылка КАК ГруппаПосле
				  //|ИЗ
				  //| Пользователи КАК Пользователи
				  //|     ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мСведенияОСотрудниках.СрезПоследних(&ДатаСреза, ) КАК мСведенияОСотрудникахСрезПоследних
				  //|     ПО Пользователи.Пользователь = мСведенияОСотрудникахСрезПоследних.Пользователь
				  //|     ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
				  //|     ПО Пользователи.Пользователь = ГруппыПользователейСостав.Пользователь,
				  //| Подразделения КАК Подразделения
				  //|ГДЕ
				  //| мСведенияОСотрудникахСрезПоследних.Пользователь = Пользователи.Пользователь";
				  
	Результат = Запрос.Выполнить().Выгрузить();
	//Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("Таблица", Результат);
	//ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПользователях", Результат[0].Выгрузить());
	//ТаблицыДляДвижений.Вставить("ТаблицаСведенияОСотрудниках", Результат[1].Выгрузить());
	//ТаблицыДляДвижений.Вставить("ТаблицаСведенияОСотрудникахИзменения", Результат[4].Выгрузить());
		
КонецПроцедуры 

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента1(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", ДокументСсылка.Дата - 24 * 60 * 60);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
                  | мИзменениеСведенийОСотрудникахСотрудники.Пользователь,
                  | мИзменениеСведенийОСотрудникахСотрудники.Подразделение,
                  | мИзменениеСведенийОСотрудникахСотрудники.Должность,
                  | мИзменениеСведенийОСотрудникахСотрудники.ГрафикРаботы,
                  | мИзменениеСведенийОСотрудникахСотрудники.Ранг
                  |ИЗ
                  | Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
                  |ГДЕ
                  | мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | мИзменениеСведенийОСотрудникахСотрудники.Период,
                  | мИзменениеСведенийОСотрудникахСотрудники.Пользователь,
                  | мИзменениеСведенийОСотрудникахСотрудники.Оклад,
                  | мИзменениеСведенийОСотрудникахСотрудники.Подразделение,
                  | мИзменениеСведенийОСотрудникахСотрудники.Должность
                  |ИЗ
                  | Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
                  |ГДЕ
                  | мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | мИзменениеСведенийОСотрудникахСотрудники.Подразделение,
                  | мИзменениеСведенийОСотрудникахСотрудники.Пользователь,
                  | ГруппыПользователей.Ссылка
                  |ПОМЕСТИТЬ Подразделения
                  |ИЗ
                  | Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
                  |     ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей КАК ГруппыПользователей
                  |     ПО (мИзменениеСведенийОСотрудникахСотрудники.Подразделение.Наименование ПОДОБНО ГруппыПользователей.Наименование)
                  |ГДЕ
                  | мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | мИзменениеСведенийОСотрудникахСотрудники.Пользователь
                  |ПОМЕСТИТЬ Пользователи
                  |ИЗ
                  | Документ.мИзменениеСведенийОСотрудниках.Сотрудники КАК мИзменениеСведенийОСотрудникахСотрудники
                  |ГДЕ
                  | мИзменениеСведенийОСотрудникахСотрудники.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | мСведенияОСотрудникахСрезПоследних.Подразделение КАК ПодразделениеДо,
                  | мСведенияОСотрудникахСрезПоследних.Должность,
                  | Пользователи.Пользователь КАК Пользователь,
                  | мСведенияОСотрудникахСрезПоследних.Пользователь КАК Пользователь1,
                  | ГруппыПользователейСостав.Ссылка КАК ГруппаДо,
                  | Подразделения.Подразделение КАК ПодразделениеПосле,
                  | Подразделения.Ссылка КАК ГруппаПосле
                  |ИЗ
                  | Пользователи КАК Пользователи
                  |     ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мСведенияОСотрудниках.СрезПоследних(&ДатаСреза, ) КАК мСведенияОСотрудникахСрезПоследних
                  |     ПО Пользователи.Пользователь = мСведенияОСотрудникахСрезПоследних.Пользователь
                  |     ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
                  |     ПО Пользователи.Пользователь = ГруппыПользователейСостав.Пользователь,
                  | Подразделения КАК Подразделения
                  |ГДЕ
                  | мСведенияОСотрудникахСрезПоследних.Пользователь = Пользователи.Пользователь";
				  
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПользователях", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСведенияОСотрудниках", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаСведенияОСотрудникахИзменения", Результат[4].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
